Функция ПодключитьОбработку(ИмяОбработки) Экспорт
	Каталог = КаталогОбработчиков();
	
	Если НЕ Прав(Каталог, 1) = "\" Тогда
		Каталог = Каталог + "\";
	КонецЕсли;
	ИмяФайла = Каталог + ИмяОбработки + ".epf";
	
	Файл = Новый Файл(ИмяФайла);
	Если НЕ Файл.Существует() Тогда
		// todo извлечь из хранилища
	ИначеЕсли ИмяОбработки = "леLiteExchange2" Тогда // Извлечь обработку из макета и повторить
		Макет = ПолучитьОбщийМакет("леМакетliteExchange2");
		Попытка
			Макет.Записать(ИмяФайла);		
		Исключение
			лаЛоггирование.СообщитьОбОшибке("Ошибка при извлечении обработки " + ИмяОбработки + ": " + ОписаниеОшибки());
			Возврат Неопределено;
		КонецПопытки;		
	КонецЕсли;
	
	Обработка = ЗагрузитьОбработку(ИмяФайла, ИмяОбработки);
	
	Если Обработка = Неопределено Тогда
		// todo добавить инструкцию по устранению проблемы
		ТекстСообщения = "Не удалось загрузить обработку " + ИмяОбработки;
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
КонецФункции

Функция КаталогОбработчиков() Экспорт
	Строка = СтрокаСоединенияИнформационнойБазы();
	Если Найти(Строка, "File") Тогда
		ДанныеСтроки = СтрРазделить(Строка, "=");
		Возврат Сред(ДанныеСтроки[1], 2, СтрДлина(ДанныеСтроки[1])-3);
	Иначе
		Возврат КаталогВременныхФайлов();
	КонецЕсли;
КонецФункции

Функция ЗагрузитьОбработку(ИмяФайла, ИмяОбработки)
	
	
	Защита = Новый ОписаниеЗащитыОтОпасныхДействий;
	Защита.ПредупреждатьОбОпасныхДействиях = Ложь;
	
	Попытка
		Обработка = ВнешниеОбработки.Создать(ИмяФайла, Ложь, Защита);
		Возврат Обработка;
	Исключение
		лаЛоггирование.СообщитьОбОшибке("Ошибка при подключении обработки " + ИмяОбработки + ": " + ОписаниеОшибки());			
	КонецПопытки;
	Возврат Неопределено;
КонецФункции